In [47]:
import pandas as pd
import numpy as np
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [4]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'],
index=['a', 'b', 'c'])
days

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [5]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [9]:
chris = { 'Country' : [ 'Ghana' , 'Kenya' , 'Nigeria' , 'Togo' ],
'Capital' : [ 'Accra' , 'Nairobi' , 'Abuja' , 'Lome' ],
'Population' : [ 10000, 8500, 35000, 12000 ],
'Age' : [ 60, 70, 80, 75 ]
}
df = pd.DataFrame(chris, index=[ 2, 4, 6, 8 ])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [15]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

#The function of iloc is to selects values from rows and columns using the integer index to locate the position

In [16]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

loc selects the label

In [23]:
df1 = df['Age']
df1

2    60
4    70
6    80
8    75
Name: Age, dtype: int64

In [32]:
df.at[8, 'Population']

12000

#the at selects the label

In [33]:
df.iat[3, 2]

12000

the iat selects indices

In [34]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [39]:
df['Population'].sum()

65500

In [40]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [53]:
df2 = {'name': ['tobi', 'ola', np.nan, 'fresh'],
       'profession': ['actor', 'shoemaker', 'Ai designer', 'petroleum engineer'],
       'experience': [np.nan, '5', '3', '2'],
       'relationship status': ['complicated', np.nan, 'married', 'engaged']
}
chris2 = pd.DataFrame(df2, index=[ 2, 4, 6, 8 ])
chris2

    name          profession experience relationship status
2   tobi               actor        NaN         complicated
4    ola           shoemaker          5                 NaN
6    NaN         Ai designer          3             married
8  fresh  petroleum engineer          2             engaged

In [54]:
chris2.isnull()

    name  profession  experience  relationship status
2  False       False        True                False
4  False       False       False                 True
6   True       False       False                False
8  False       False       False                False

In [55]:
chris2.dropna()

    name          profession experience relationship status
8  fresh  petroleum engineer          2             engaged

In [58]:
chris2.fillna('error hehehe')

           name          profession    experience relationship status
2          tobi               actor  error hehehe         complicated
4           ola           shoemaker             5        error hehehe
6  error hehehe         Ai designer             3             married
8         fresh  petroleum engineer             2             engaged